/* overworld.cpp

This .cpp file controls character movement in the overworld, background changes, and initiation of battles

Author: J. Patrick Lacher
*/

#include <SDL2/SDL.h>
#include <SDL2/SDL_image.h>
#include <stdio.h>
#include <string>
#include <iostream>
#include <stdlib.h>
#include <time.h>
#include "headers/Trainer.h"
#include "headers/Pokemon.h"


//Screen dimension constants
const int SCREEN_WIDTH = 900;
const int SCREEN_HEIGHT = 900;

//The player sprite that will move around on the screen
class Ash
{
    public:
		//The dimensions of Ash
		static const int ASH_WIDTH = 32;
		static const int ASH_HEIGHT = 32;

		//Maximum axis velocity of ash
		static const int ASH_VEL = 10;

		//Initializes the variables
		Ash();

		//Takes key presses and adjusts Ash's velocity
		void handleEvent( SDL_Event& e );

		//Moves Ash
		void move();

		//Shows Ash on the screen
		void render();
		
		//Checks if Ash has entered a door
		int changeScene( int bg );
		
		//Checks if Ash has collided with a wall
		void checkCollision( int bg );
		
		//Checks for a battle in the current room
		bool isBattle( int bg, int battle );

    private:
		//The X and Y offsets of Ash
		int mPosX, mPosY;

		//The velocity of Ash
		int mVelX, mVelY;
};

//Texture wrapper class
class LTexture
{
	public:
		//Initializes variables
		LTexture();

		//Deallocates memory
		~LTexture();

		//Loads image at specified path
		bool loadFromFile( std::string path );
		
		#ifdef _SDL_TTF_H
		//Creates image from font string
		bool loadFromRenderedText( std::string textureText, SDL_Color textColor );
		#endif

		//Deallocates texture
		void free();

		//Set color modulation
		void setColor( Uint8 red, Uint8 green, Uint8 blue );

		//Set blending
		void setBlendMode( SDL_BlendMode blending );

		//Set alpha modulation
		void setAlpha( Uint8 alpha );
		
		//Renders texture at given point
		void render( int x, int y, SDL_Rect* clip = NULL, double angle = 0.0, SDL_Point* center = NULL, SDL_RendererFlip flip = SDL_FLIP_NONE );

		//Gets image dimensions
		int getWidth();
		int getHeight();

	private:
		//The actual hardware texture
		SDL_Texture* mTexture;

		//Image dimensions
		int mWidth;
		int mHeight;
};

//Initializes SDL
bool init();

//Loads media
bool loadMedia();

//Ends SDL
void close();

//Event handler
SDL_Event e;

//The target window
SDL_Window* gWindow = NULL;

//The window renderer
SDL_Renderer* gRenderer = NULL;

//Trainer Sprite Textures
LTexture gAshTexture; //player character
LTexture gDougTexture; //enemy 1
LTexture gJohnTexture; //enemy 2
LTexture gPatrickTexture; //enemy 3

//NPC Textures
LTexture gOffficerTexture; //officer
LTexture gLassTexture; //lass
LTexture gLassPkmnTexture; //lass' pokemon
LTexture gProfTexture; //professor
LTexture gProfPkmnTexture; //professor's pokemon

//Background Textures
LTexture gBG1Texture; //exterior background
LTexture gBG2Texture; //interior background
LTexture gBG3Texture; //interior hallway backgrond
LTexture gBG4Texture; //room 1 background
LTexture gBG5Texture; //room 2 background
LTexture gBG6Texture; //room 3 background
LTexture gBG7Texture; //room 4 background

//Pokemon Textures
LTexture gAerodactylTexture; //1
LTexture gAlakazamTexture; //2
LTexture gArbokTexture; //3
LTexture gArcanineTexture; //4
LTexture gBlastoiseTexture; //5
LTexture gBulbasaurTexture; //6
LTexture gButterfreeTexture; //7
LTexture gChanseyTexture; //8
LTexture gCharizardTexture; //9
LTexture gDodrioTexture; //10
LTexture gDragoniteTexture; //11
LTexture gDugtrioTexture; //12
LTexture gElectabuzzTexture; //13
LTexture gElectrodeTexture; //14
LTexture gFearowTexture; //15
LTexture gGengarTexture; //16
LTexture gGolbatTexture; //17
LTexture gGolduckTexture; //18
LTexture gGolemTexture; //19
LTexture gGravelerTexture; //20
LTexture gGyaradosTexture; //21
LTexture gHitmonchanTexture; //22
LTexture gJigglypuffTexture; //23
LTexture gKadabraTexture; //24
LTexture gKinglerTexture; //25
LTexture gLaprasTexture; //26
LTexture gMagmarTexture; //27
LTexture gMarowakTexture; //28
LTexture gNinetalesTexture; //29
LTexture gOnixTexture; //30
LTexture gPidgeotTexture; //31
LTexture gPikachuTexture; //32
LTexture gRaichuTexture; //33
LTexture gRhydonTexture; //34
LTexture gRhyhornTexture; //35
LTexture gShuckleTexture; //36
LTexture gSnorlaxTexture; //37
LTexture gVaporeonTexture; //38
LTexture gVenusaurTexture; //39

//Battle Textures
LTexture gBattleScreenTexture; //background
LTexture gHighHealthTexture; //health bar
LTexture gMedHealthTexture; //50% depleted health bar
LTexture gLowHelathTexture; //80% depleted health bar

//Move Text Box Textures
LTexture gAerodactylMovesTexture; //1
LTexture gAlakazamMovesTexture; //2
LTexture gArbokMovesTexture; //3
LTexture gArcanineMovesTexture; //4
LTexture gBlastoiseMovesTexture; //5
LTexture gBulbasaurMovesTexture; //6
LTexture gButterfreeMovesTexture; //7
LTexture gChanseyMovesTexture; //8
LTexture gCharizardMovesTexture; //9
LTexture gDodrioMovesTexture; //10
LTexture gDragoniteMovesTexture; //11
LTexture gDugtrioMovesTexture; //12
LTexture gElectabuzzMovesTexture; //13
LTexture gElectrodeMovesTexture; //14
LTexture gFearowMovesTexture; //15
LTexture gGengarMovesTexture; //16
LTexture gGolbatMovesTexture; //17
LTexture gGolduckMovesTexture; //18
LTexture gGolemMovesTexture; //19
LTexture gGravelerMovesTexture; //20
LTexture gGyaradosMovesTexture; //21
LTexture gHitmonchanMovesTexture; //22
LTexture gJigglypuffMovesTexture; //23
LTexture gKadabraMovesTexture; //24
LTexture gKinglerMovesTexture; //25
LTexture gLaprasMovesTexture; //26
LTexture gMagmarMovesTexture; //27
LTexture gMarowakMovesTexture; //28
LTexture gNinetalesMovesTexture; //29
LTexture gOnixMovesTexture; //30
LTexture gPidgeotMovesTexture; //31
LTexture gPikachuMovesTexture; //32
LTexture gRaichuMovesTexture; //33
LTexture gRhydonMovesTexture; //34
LTexture gRhyhornMovesTexture; //35
LTexture gShuckleMovesTexture; //36
LTexture gSnorlaxMovesTexture; //37
LTexture gVaporeonMovesTexture; //38
LTexture gVenusaurMovesTexture; //39

LTexture::LTexture()
{
	//Initialize
	mTexture = NULL;
	mWidth = 0;
	mHeight = 0;
}

LTexture::~LTexture()
{
	//Deallocate
	free();
}

bool LTexture::loadFromFile( std::string path )
{
	//Get rid of preexisting texture
	free();

	//The final texture
	SDL_Texture* newTexture = NULL;

	//Load image at specified path
	SDL_Surface* loadedSurface = IMG_Load( path.c_str() );
	if( loadedSurface == NULL )
	{
		printf( "Unable to load image %s! SDL_image Error: %s\n", path.c_str(), IMG_GetError() );
	}
	else
	{
		//Color key image
		SDL_SetColorKey( loadedSurface, SDL_TRUE, SDL_MapRGB( loadedSurface->format, 0, 0xFF, 0xFF ) );

		//Create texture from surface pixels
        newTexture = SDL_CreateTextureFromSurface( gRenderer, loadedSurface );
		if( newTexture == NULL )
		{
			printf( "Unable to create texture from %s! SDL Error: %s\n", path.c_str(), SDL_GetError() );
		}
		else
		{
			//Get image dimensions
			mWidth = loadedSurface->w;
